Задача!
=
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам.

Этап 1
-
*Создаём программу, очищающую консоль.*

```
Console.Clear();
```

Этап 2
-
*Методом ReadLine задаём ввод в консоль пяти элементов массива.*

```
System.Console.Write("Введие первый элемент :");
string el = Console.ReadLine();
```

Этап 3
-
*Создаём первичный массив, в котором будут прописанны пять элементов массива введенные пользователем.*

```
string[] primary = new string[]{el1,el2,el3,el4,el5};
```

Этап 4
-
*Создаём переменную count, который будет считать количество элементов из массива, в котором длина элемента меньше или равна 3.*

```
int count = 0;
```

Этап 5
-
*Через цикл FOR находим количество элементов массива с длиной 3 или меньше: внутри цикла делаем условие, что если размер элемента массива меньше или равен 3, тогда переменную count увеличиваем на единицу.*

```
for (int i = 0; i < primary.Length; i++)
{
    if (primary[i].Length <= 3)
    {
        count++;
    }
}
```

Этап 6
-
*Создаем вторичный массив с количеством элементов равным count.*

```
string [] secondary = new string[count];
```

Этап 7
-
*Создаём переменную index, которая будет выписывать из первичного массива те элементы, длина которых равна 3 или меньше.*

```
int index = 0;
```

Этап 8
-
*Через цикл FOR считываем каждый элемент первичного массива: внутри цикла делаем условие, при котором если длина первичного элемента меньше или равна 3, тогда этот элемент прописываем во вторичный массив с индексом index, после переменную index увеличиваем на единицу.*

```
for (int i = 0; i < primary.Length; i++)
{
    if (primary[i].Length <= 3)
    {
        secondary[index] = primary[i];
        index++;
    }
}
```

Этап 9
-
*Выводим на консоль первичный и вторичный массивы.*
```
System.Console.WriteLine(string.Join(",",primary));
System.Console.WriteLine(string.Join(",",secondary));
```